#
# Copyright (c) 2011-2015, BULL SAS, NovaForge Version 3 and above.
#
# This file is free software: you may redistribute and/or modify it under
# the terms of the GNU Affero General Public License as published by the
# Free Software Foundation, version 3 of the License.
#
# This file is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty
# of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Affero General Public License for more details.
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see http://www.gnu.org/licenses.
#
# Additional permission under GNU AGPL version 3 (AGPL-3.0) section 7.
#
# If you modify this Program, or any covered work, by linking or combining
# it with libraries listed in COPYRIGHT file at the top-level directory of
# this distribution (or a modified version of that libraries), containing parts
# covered by the terms of licenses cited in the COPYRIGHT file, the licensors
# of this Program grant you additional permission to convey the resulting work.
#

############ IHM ###################
TECHNICAL_ERROR = Une erreur technique est intervenue. Merci de contacter votre administrateur.
AUTHENTIFICATION_ERROR = Impossible d''identifier l''utilisateur. Merci de contacter votre administrateur.

ERR_INVALID_CRON_EXPRESSION = L''expression cron saisie pour l''ordonnancement du Batch du serveur CDO n''est pas valide.
ERR_PROJECT_PLAN_GET_LIST = Impossible de r\u00E9cup\u00E9rer la liste des plans projet.
ERR_PROJECT_PLAN_GET_ELEMENT = Impossible de r\u00E9cup\u00E9rer cette version du plan projet.
ERR_PROJECT_PLAN_DELETE_WRONG_VERSION = La version du plan projet que vous tentez de supprimer n''est pas la derni\u00E8re.Seule la derni\u00E8re version peut \u00eatre supprim\u00E9e.

ERR_LOT_HAVING_BOTH_LOTS_AND_ITERATIONS = Un lot ne peut contenir simultan\u00E9ment des sous-lots et des it\u00E9rations.
ERR_LOT_END_DATE_BEFORE_ITERATION_END_DATE = La date de fin du lot est ant\u00E9rieure \u00e0 la fin de l''une de ses it\u00E9rations. veuillez supprimer cette it\u00E9ration et recommencer. 
ERR_LOT_DATE_NOT_COMPLIANT_WITH_ITERATION = Des it\u00E9rations dont les dates ne sont pas comprises dans le lot existent. Modifier les dates du lot ou des it\u00E9rations et recommencer.  
ERR_TWO_LOT_HAVING_SAME_NAME_IN_A_PROJECT_PLAN = Pour une version d''un projet plan, il ne peut y avoir deux lots avec le m\u00eame nom.
ERR_LOT_WRONG_SUB_LOT_DATE = Un sous-lot ne peut pas avoir des dates de d\u00E9but et de fin en dehors de la p\u00E9riode de son lot parent.
ERR_LOT_NO_OVERLAP = Deux lots de m\u00EAme niveau ne doivent pas se chevaucher.
ERR_LOT_WRONG_DATE = La date de d\u00E9but doit \u00eatre inf\u00E9rieure \u00e0 la date de fin.
ERR_LOT_DELETE_LOT_HAVING_ITERATIONS = Des it\u00E9rations sont rattach\u00E9es \u00e0 ce lot. Vous devez les modifier, les supprimer ou les retirer avant de pouvoir supprimer ce lot.
ERR_LOT_CHILDS_LOT_NOT_IN_PARENT_LOT = Les p\u00E9riodes des sous-lots ne correspondent plus. Veuillez les modifier. 
ERR_LOT_DELETE_LOT_HAVING_SCOPE_UNITS = Ce lot ou un de ses sous-lots poss\u00E8de des unit\u00E9s de p\u00E9rim\u00E8tres. Veuillez les supprimer ou les d\u00E9placer.
ERR_LOT_DELETE_LOT_IS_A_COPY = Ce lot est une copie d''un lot d''une pr\u00E9c\u00E9dente version du project plan. Vous ne pouvez pas le supprimer


ERR_CHARGEPLAN_NO_DISCIPLINE = Aucune discipline en base. Veuillez contacter votre administrateur.
ERR_CHARGEPLAN_WRONG_SUM_PERCENT_DISCIPLINES = La r\u00E9partition des disciplines est erron\u00E9e, la somme des r\u00E9partitions doit \u00EAtre \u00E9gale \u00E0 100

ERR_PLUGIN_AVAILABILY = Le plugin n''est pas disponible. 
ERR_ITERATION_IN_PAST = L''it\u00E9ration ne doit pas compl\u00E8tement \u00EAtre dans le pass\u00E9
ERR_ITERATION_REQUIRED_LOT = Le champ lot est obligatoire
ERR_ITERATION_REQUIRED_PHASE_TYPE = Le champ phase type est obligatoire
ERR_ITERATION_REQUIRED_START_DATE = Le champ date de d\u00E9but est obligatoire
ERR_ITERATION_REQUIRED_END_DATE = Le champ date de fin est obligatoire
ERR_ITERATION_NOT_CONTAINS_IN_LOT = L''it\u00E9ration doit compl\u00E8tement \u00EAtre contenue dans le lot
ERR_ITERATION_NO_OVERLAP = Les it\u00E9rations ne doivent pas se chevaucher
ERR_ITERATION_NO_DELETE_IF_NOT_LAST = Seule la derni\u00E8re it\u00E9ration peut \u00EAtre supprim\u00E9e (derni\u00E8re au regard des dates).
ERR_ITERATION_NO_DELETE_IF_HAS_TASKS = Cette it\u00E9ration contient des t\u00E2ches et ne peut donc \u00EAtre supprim\u00E9e.
ERR_ITERATION_CLOSE_IS_FINISHED = Cette it\u00E9ration est d\u00E9j\u00E0 termin\u00E9e.
ERR_ITERATION_CLOSE_IS_NOT_OLDEST = Impossible de fermer cette it\u00E9ration car il en existe une ouverte plus ancienne.
ERR_ITERATION_CLOSE_REMAINING_TASKS_AND_NO_MORE_ITERATION = Impossible de fermer cette it\u00E9ration car elle contient des t\u00E2ches  non termin\u00E9es et il n''existe pas d''it\u00E9ration apr\u00E8s pour les reprendre. Veuillez fermer les t\u00E2ches ou cr\u00E9er une it\u00E9ration.

ERR_TASK_CATEGORY_NO_DELETE_IF_HAS_TASKS=  Cette cat\u00E9gorie de t\u00E2che  contient des t\u00E2ches et ne peut donc \u00EAtre supprim\u00E9e.

ERR_SCOPE_UNIT_LINKED_TO_ITERATION = On ne peut pas supprimer une unit\u00E9 de p\u00E9rim\u00E8tre lanc\u00E9e sur une it\u00E9ration
ERR_SCOPE_UNIT_NAME_ALREADY_EXIST = Une unit\u00E9 de p\u00E9rim\u00E8tre poss\u00E8dant ce nom existe d\u00E9j\u00E0. veuillez le modifier. 
ERR_SCOPE_UNIT_NOT_LINKED_TO_LOT = Une unit\u00E9 de p\u00E9rim\u00E8tre doit \u00EAtre li\u00E9e \u00E0 un lot. Veuillez en s\u00E9lectionner un.

ERR_AUTHENTIFICATION_OR_RIGHTS = Vous n''\u00EAtes pas correctement authentifi\u00E9 ou vous n''avez pas le droit d''acc\u00E9der \u00E0 cette fonctionnalit\u00E9.

BUG_TRACKER_COMMUNICATION_PROBLEM = Un probl\u00E8me de communication avec le gestionnaire d''anomalie s''est produit.
BUG_TRACKER_ASSOCIATION_DOES_NOT_EXIST = La connection au gestionnaire d''anomalies n''est pas configur\u00E9e dans votre forge.

ERROR_OUT_OF_DATE=La version du serveur semble obsol\u00E8te, veuillez recharger votre page.
ERROR_SERIALIZATION=Une erreur est apparue lors de la s\u00E9rialisation des donn\u00E9es, veuillez r\u00E9-essayer.
ERROR_SERVER_TIMEOUT=Le serveur a mis trop de temps \u00E0 r\u00E9pondre.
ERROR_SERVER_ERROR=Une erreur est survenue lors de l''appel au serveur, votre session est reinitialis\u00E9e.
